app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
	def index
    Rails.logger.info "Books Path: #{books_path}\nBooks URL: #{books_url}\nBook Path: #{book_path(1)}\nBook URL: #{book_url(1)}\nEdit Book Path: #{edit_book_path(1)}\nEdit Book URL: #{edit_book_url(1)}}"
    @books = Book.all

INSERT INTO "books" ("author", "created_at", "description", "image", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "publisher", "rank_this_week", "title", "updated_at", "weeks_on_list") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
   def create
    # @books= Book.all
    # @c=Book.all
    b = Book.new(params[:book])
    if b.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "books" SET "image_file_name" = '3.jpeg', "image_content_type" = 'image/jpeg', "image_file_size" = 6965, "image_updated_at" = '2015-09-11 12:07:34.064672', "updated_at" = '2015-09-11 12:07:34.422833' WHERE "books"."id" = 1
---
    def update
      @book = Book.find(params[:id])
      if @book.update_attributes(params[:book])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
---
    def new_comment
      @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("book_id", "commentforbook", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["commentforbook", "abcd 1234"], ["created_at", Thu, 10 Sep 2015 13:40:12 UTC +00:00], ["updated_at", Thu, 10 Sep 2015 13:40:12 UTC +00:00]]
---
    def create_comment
     @book = Book.find(params[:id])
     b =@book.comments.new(params[:comment])
     if b.save

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
---
    def comments
      @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
    def destroy
     @book =Book.find(params[:id])

     if @book.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "books" WHERE "books"."id" = 4
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 10]]
---
     def delete_comment
      @book =Book.find(params[:id])
      @comments=@book.comments.destroy(params[:comment_id])